# DetailCurveArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DetailCurveArray Constructor
DetailCurveArray Class See Also
---
Initializes a new instance of the DetailCurveArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DetailCurveArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DetailCurveArray()
```

# See Also
DetailCurveArray Class
Autodesk.Revit.DB Namespace